Repository: stewartadam/fwbackups
Catalog: po/*.po
Languages: ru, uk

source: *** Initializing files
ru: *** Инициализация файлов

source: Folder %s exists and will be emptied. Press <Enter> to confirm or <ctrl+c> to cancel...
ru: Папка %s существует и должна быть очищена. Нажмите <Enter> для подтверждения или <ctrl+c> для отмены...

source: Cleaning folder %s...
ru: Очистка папки %s...

source: *** Remote settings
ru: *** Удалённые настройки

source: Hostname [localhost]:
ru: Имя хоста [localhost]:

source: Port [22]:
ru: Порт [22]:

source: The port field can only contain numbers. Please try again.
ru: Поле Порт может содержать только число. Введите заново.

source: Username [%s]:
ru: Имя пользователя [%s]:

source: Password:
ru: Пароль:

source: Remote folder [%s]:
ru: Удалённая папка [%s]:

source: *** Running %(a)s backup with engine %(b)s
ru: *** Запуск %(a)s резервирования на движке %(b)s

source: Backup failed!
ru: Сбой создания резервной копии!

source: *** Running restore of remote test backup %s
ru: *** Запуск восстановления внешней тестовой копии %s

source: Backup
ru: Резервная копия
uk: Резервна копія

source: Restore failed!
ru: Восстановление не удалось!

source: *** Running restore of local test backup %s
ru: *** Запуск восстановления локальной тестовой копии %s

source: *** Running restore of a local archive
ru: *** Запуск восстановления локального архива

source: *** Running restore of a local folder
ru: *** Запуск восстановления локальной папки

source: *** Running restore of a remote archive (SSH)
ru: *** Запуск восстановления внешнего архива (SSH)

source: *** Running restore of a remote folder (SSH)
ru: *** Запуск восстановления внешней папки (SSH)

source: Error: %s
ru: Ошибка: %s

source: Run with --help for usage information.
ru: Запустите с --help для получения дополнительной информации.

source: Usage: fwbackups-run [OPTIONS] Set_Name(s) Options: -v, --verbose : Increase verbosity (print debug messages) -h, --help : Print this message and exit -l, --silent : Print messages to log file only Set_Name(s) is space-seperated list of set names to run backups of.
ru: Использование: fwbackups-run [параметры] имена_наборов Параметры: -v, --verbose : Выдать больше информации (печать сообщения дебагинга) -h, --help : Напечатать это сообщение и выйти -l, --silent : Выводить сообщения только в файл журнала Имена_наборов представляют собой заданные через пробел наборы для резервирования.

source: Invalid usage: Requires at least one set name to backup
ru: Неверное использование: Требуется как минимум одно имя конфигурации для резервирования

source: The set configuration for '%s' was not found - skipping.
ru: Настройки набора для '%s' не найдены - пропуск.

source: An error occurred while initializing the backup operation!
ru: Ошибка при инициализации операции резервирования!

source: Thread returned with retval %s
ru: Поток вернул ошибку %s
uk: Потік повернув помилку %s

source: There was an error while performing the backup!
ru: Ошибка при выполнении резервирования!
uk: Помилка при виконанні резервування!

source: Usage: fwbackups-runonce --destination-type=TYPE --engine=ENGINE [OPTIONS] Path(s) Destination Options: -v, --verbose : Increase verbosity (print debug messages) -h, --help : Print this message and exit -r, --recursive : Perform a recursive backup -i, --hidden : Include hidden files in the backup -p, --packages2file : Print installed package list to a text file -d, --diskinfo2file : Print disk geometry to a file (must be root) -s, --sparse : Handle sparse files efficiently -e, --engine=ENGINE : Use specified backup engine. Valid engines are tar, tar.gz, tar.bz2 and rsync. -x, --exclude='PATTERN' : Skip files matching PATTERN. -n, --nice=NICE : Indicate the niceness of the backup process (-20 to 19) --destination-type=TYPE : Destination type (`local' or `remote (ssh)') --remote-host=HOSTNAME : Connect to remote host `HOSTNAME' --remote-user=USERNAME : Connect as specified username --remote-password=PASSWORD : Connect using password `PASSWORD' --remote-port=PORT : Connect on specified port (default 22) Path(s) is space-seperated list of paths to include in the backup. Destination is the directory where the OneTime backup should be placed within. Defaults to tar engine and local destination unless specified otherwise. Supplying --remote* will have no effect unless thedestination type is `remote (ssh)'.
ru: Использование: wbackups-runonce --destination-type=ТИП --engine=ДВИЖОК [ПАРАМЕТРЫ] Путь(Пути) Назначение Параметры: -v, --verbose : Выдать больше информации (печать сообщения дебагинга) -h, --help : Напечатать это сообщение и выйти -r, --recursive : Выполнить рекурсивное резервирование -i, --hidden : Включить в резервную копию скрытые файлы -p, --packages2file : Вывести список установленных пакетов в текстовый файл -d, --diskinfo2file : Вывести геометрию диска в файл (должны быть права root) -s, --sparse : Более эффективно поддерживать разреженные файлы -e, --engine=ДВИЖОК : Использовать определенный движок резервирования. Доступны следующие движки: tar, tar.gz, tar.bz2 и rsync. -x, --exclude='МАСКА' : Пропустить файлы, совпадающие с МАСКОЙ. -n, --nice=NICE : задать nice для процесса резервирования (от -20 до 19) --destination-type=ТИП : Тип назначения (`local' или `remote (ssh)') --remote-host=ИМЯ_ХОСТА : Подключиться к удалённому хосту с именем `ИМЯ_ХОСТА' --remote-user=ИМЯ_ПОЛЬЗОВАТЕЛЯ : Подключиться под определённым пользователем --remote-password=ПАРОЛЬ : Подключиться с использованием пароля `ПАРОЛЬ --remote-port=PORT : Подключиться к заданному порту (по умолчанию 22) Путь(пути) - пути для резервирования через пробел. Назначение - папка, где должна быть помещена Одномоментная резервная копия. По умолчанию в качестве движка используется tar и локальное расположение копии. Параметры удалённого сервера не будут применены, пока назначение не будет установлено в `remote (ssh)'.

source: No such engine `%s'
ru: Нет такого движка: `%s'

source: You must be root to set a niceness below 0
ru: Вы должны иметь права root для nice ниже 0

source: Nice value must be an integer between -20 and 19
ru: Значение nice может быть числом от -20 до 19

source: Requires at least one path to backup and a destination
ru: Требуется как минимум один путь для резервирования и назначение

source: Destination type was not specified
ru: Тип назначения не определён

source: An engine was not specified
ru: Не задан движок

source: An error occurred while importing gtk/gobject.
ru: Ошибка при импорте gtk/gobject.

source: Please make sure you have a valid GTK+ Runtime Environment.
ru: Убедитесь, что у вас установлена нужная версия GTK+.

source: fwbackups bug report written saved at %s
ru: Сообщение об ошибке fwbackups записано как %s

source: Could not write bug report due to insufficient permissions.
ru: Невозможно записать сообщение об ошибке из-за недостатка прав.

source: Please install pycrypto (python-crypto)
ru: Установите pycrypto (python-crypto)

source: Please install paramiko (python-paramiko)
ru: Установите paramiko (python-paramiko)

source: Idle
ru: Ожидание
uk: Очікування

source: Click 'Backup Set Now' to begin
ru: Нажмите 'Резервировать сейчас' для начала
uk: Натисніть 'Резервувати зараз' для початку

source: Click 'Start Backup' to begin
ru: Нажмите "Запуск резервирования" для начала
uk: Натисніть "Початок резервування" для початку

source: Click 'Start Restore' to begin
ru: Нажмите 'Старт восстановления' для начала
uk: Натисніть 'Початок відновлення' для початку

source: <span size="small">%s%% complete: %s</span>
ru: <span size="small">%s%% завершено: %s</span>

source: Checking permissions
ru: Проверка прав

source: Could not setup the fwbackups configuration folder
ru: Невозможно задать папку настроек fwbackups
uk: Неможливо вказати теку налаштувань fwbackups

source: The following error occured: %s
ru: Произошла следующая ошибка: %s
uk: Сталася наступна помилка: %s

source: Setting up the logger and user preferences
ru: Настройка журнала и прав пользователя

source: Validation error: %s
ru: Ошибка проверки: %s
uk: Помилка перевірки: %s

source: Preferences could not be read
ru: Невозможно прочитать настройки
uk: Неможливо прочитати налаштування

source: The preferences file may be corrupted and could not be read by fwbackups. Would you like to initialize a new one from the default values? If not, fwbackups will exit.
ru: Файл настроек может быть повреждён или недоступен для чтения fwbackups. Вы хотите создать новый с настройками по умолчанию? Если нет, то fwbackups завершит работу.
uk: Файл налаштувань може бути пошкоджений або недоступний для читання fwbackups. Ви бажаєте створити новий з типовими налаштуваннями ? Якщо ні, то fwbackups припинить роботу.

source: Populating the log viewer
ru: Заполнение просмотрщика журнала

source: Could not setup the logger
ru: Невозможно настроить журналирование
uk: Неможливо налаштувати журналювання

source: pynotify was not found. Notifcations will not be displayed unless notify-python/pynotify is installed.
ru: pynotify не найден. Оповещения не будут отображаться, пока не будет установлен notify-python/pynotify.

source: Cleaning after previous versions
ru: Очистка после предыдущей версии

source: Previous installation of fwbackups 1.42.x or older detected
ru: Обнаружена предыдущая (1.42) или более старая версия fwbackups.
uk: Виявлена попередня (1.42) або старіша версія fwbackups.

source: Because of certain major changes in fwbackups, your configuration must be imported manually. To do this, run fwbackups as the root user and select <i>File > Import</i> from the menu to import your old configuration. If this action is not completed, the backups from version 1.42.x <b>will not run automatically</b>. <i>Tip: The 1.42.x configuration was stored in /etc/fwbackups</i>.
ru: Из-за некоторых серьезных изменений в fwbackups, ваша конфигурация должна быть импортированы вручную. Для этого надо запустить fwbackups от root выбрать <i> Файл > Импорт </i> из меню, чтобы импортировать ваши старые настройки. Если не сделать это, то резервные копии с версии 1.42.x <b>не будут запускаться автоматически </b>. <i>Совет: Конфигурация версии 1.42.x хранится в файле /etc/fwbackups</i>.
uk: З-за деяких серйозних змін у fwbackups, Ваша конфігурація має бути імпортована вручну. Для цього потрібно запустити fwbackups від root вибрати <i> Файл > Імпорт </i> із меню, щоб імпортувати Ваші старі налаштування. Якщо це не зробити, резервні копії з версії 1.42.x <b>не будуть запускатися автоматично </b>. <i>Порада: Конфігурація версії 1.42.x зберігається у файлі /etc/fwbackups</i>.

source: A backup of /etc/crontab could not be created
ru: Резервная копия /etc/crontab не может быть создана
uk: Резервна копія /etc/crontab не може бути створена

source: You may wish to edit /etc/crontab manually and remove any fwbackups-related lines.
ru: Вы можете отредактировать etc/crontab и удалить строки, относящиеся к fwbackups.
uk: Ви можете відредагувати etc/crontab й вилучити рядки, що відносяться до fwbackups.

source: Could not create a backup of /etc/crontab; refusing to clean up.
ru: Невозможно создать резервную копию /etc/crontab; требуется очистка.
uk: Неможливо створити резервну копію /etc/crontab; потрібна очистка.

source: Cleaning up /etc/crontab from previous installation of fwbackups
ru: Очистка /etc/crontab от предыдущей установки fwbackups
uk: Очищення /etc/crontab від попереднього встановлення fwbackups

source: fwbackups was unable to clean up the system crontab: %s. You may wish to edit /etc/crontab manually and remove any fwbackups-related lines.
ru: fwbackups не может очистить системный crontab: %s. Вы можете отредактировать etc/crontab и удалить строки, относящиеся к fwbackups.
uk: fwbackups не може очистити системний crontab: %s. Ви можете відредагувати etc/crontab й вилучити рядки, що відносяться до fwbackups.

source: Cleanup of the system crontab failed
ru: Cбой очистки системного crontab
uk: Збій очистки системного crontab

source: Ready!
ru: Готов!

source: fwbackups administrator started
ru: Запуск управления fwbackups
uk: Запуск керування fwbackups

source: Would you like to clean up the log file?
ru: Вы хотите очистить файл журнала?
uk: Ви бажаєте очистити файл журналу?

source: The log file is becoming large (%s). Would you like to clear it? This will permanently remove all entries from the log.
ru: Файл журнала становится слишком большим (%s). Не хотите его очистить? Это уничтожит все записи в журнале.
uk: Файл журналу стає завеликим (%s). Не бажаєте його очистити? Це знищить усі записи в журналі.

source: Could not create notification: %s
ru: Невозможно создать оповещение: %s

source: Regenerating crontab
ru: Регенерация crontab
uk: Регенерація crontab

source: Please wait... Regenerating crontab
ru: Подождите... Идет регенерация crontab
uk: Зачекайте... Йде регенерація crontab

source: Could not parse the configuration for set '%s'
ru: Невозможно прочитать конфигурацию для набора '%s'
uk: Неможливо прочитати конфігурацію для набору '%s'

source: The set configuration file '%s' failed to validate, so it may not be properly scheduled. Other sets are unaffected by this error.
ru: Файл конфигурации набора '%s' не прошёл проверку, и поэтому не может быть верно повторён по расписанию. Другие настройки должны помочь обойти ошибку.
uk: Файл конфігурації набору '%s' не пройшов перевірку, й тому не може бути вірно повторений за розкладом. Інші налаштування мають допомогти обійти помилку.

source: Internal error: generated entry for set '%s' was not parsable. Please submit a bug report.
ru: Внутренняя ошибка: сгенерированная запись для набора '%s' не разбираема. Отправьте сообщение об ошибке.
uk: Внутрішня помилка: згенерований запис для набору '%s' не розбирається. Відправте повідомлення про ваду.

source: Could not schedule automated backups for set '%s'
ru: Невозможно создать расписание автоматического резервирования для набора '%s'
uk: Неможливо створити розклад автоматичного резервування для набору '%s'

source: fwbackups could not regenerate a crontab entry because an error occured:
ru: fwbackups не может регенерировать запись crontab из-за ошибки:
uk: fwbackups не може регенерувати запис crontab з-за помилки:

source: %(a)s The crontab entry associated with the error was: %(b)s
ru: %(a)s Запись crontab, ассоциированная с ошибкой, следующая: %(b)s
uk: %(a)s Запис crontab, асоційований з помилкою наступний: %(b)s

source: Saving set `%s' to the crontab
ru: Запись набора `%s' в crontab
uk: Запис набору `%s' у crontab

source: Unable to write new crontab: %s
ru: Не могу записать новую задачу crontab: %s
uk: Не можу записати нове завдання crontab: %s

source: Unable to save backup schedule to crontab
ru: Невозможно записать расписание резервирования в crontab

source: There was an error saving the new backup schedule. A backup will be restored, however the changes made to the backup schedule may not have been correctly saved. If you see this message, please report a bug against fwbackups.
ru: Возникла ошибка при сохранении нового расписания резервного копирования. Резервная копия будет восстановлена, однако изменения, сделанные в расписании резервного копирования, могут быть сохранены некорректно. Если вы видите это сообщение, пожалуйста, сообщите об ошибке в fwbackups.

source: A backup of the crontab was restored; the latest changes to the backup schedule not have been saved.
ru: Резервная копия crontab восстановлена; последние изменения в расписание резервного копирования не были сохранены.
uk: Резервна копія crontab відновлена; останні зміни у розклад резервного копіювання не були збережені.

source: A backup of the crontab could not be restored
ru: Резервная копия crontab не может быть восстановлена

source: fwbackups is working
ru: fwbackups работает
uk: fwbackups працює

source: An operation is currently in progress. Would you like to cancel it and quit anyways?
ru: Операция всё ещё выполняется. Вы хотите её прервать и выйти?
uk: Операція усе ще виконується. Ви бажаєте її припинити і вийти?

source: Please wait... Canceling operations
ru: Подождите... Операция отменяется
uk: Зачекайте... Операція скасовується

source: fwbackups detected more than one alive threads!
ru: fwbackups обнаружил более одного живого потока!
uk: fwbackups виявив більше одного живого потоку!

source: Closed dead Paramiko thread: %s
ru: Закрыт умерший поток Paramiko: %s
uk: Закрито померлий потік Paramiko: %s

source: Could not close thread %s!
ru: Невозможно закрыть поток %s!
uk: Неможливо закрити потік %s!

source: Please submit a bug report and include this message.
ru: Отправьте сообщение об ошибке, включив в него данный текст.
uk: Відправте звіт про ваду, включивши у нього даний текст.

source: Could not save backup schedule
ru: Не удалось сохранить расписание резервирования
uk: Не вдалося зберегти розклад резервування

source: fwbackups was unable to save the backup scheduling information to the crontab. If you are using manual times entry in one of your sets, please verify that all five fields are using the correct syntax.
ru: fwbackups не может записать расписание резервирования в crontab. Если вы используете ручное задание времени в одном из ваших наборов, убедитесь в правильном синтаксисе задания.
uk: fwbackups не може записати розклад резервування у crontab. Якщо Ви використовуєте ручне вказування часу у одному з Ваших наборів, переконайтеся у використанні правильного синтаксису.

source: fwbackups administrator closed
ru: Управление fwbackups закрыто
uk: Керування fwbackups закрите

source: Creating thread
ru: Создаётся поток
uk: Створюється потік

source: testConnection(): Creating thread
ru: testConnection(): Создание потока
uk: testConnection(): Створення потоку

source: Attempting to connect
ru: Попытка соединения
uk: Спроба з’єднання

source: testConnection(): Thread returning with retval %s
ru: testConnection(): Поток вернул значение %s
uk: testConnection(): Потік повернув значення %s

source: Success!
ru: Успешно!
uk: Успіх!

source: fwbackups was able to connect and authenticate on '%s'.
ru: fwbackups успешно подключился и авторизовался на '%s'.
uk: fwbackups успішно під’єднався і авторизувався на '%s'.

source: Remote destination is not usable
ru: Удалённое назначение не может использоваться
uk: Віддалене призначення не може використовуватися

source: The folder '%(a)s' on '%(b)s' either does not exist or it is not a folder. Please verify your settings and try again.
ru: Папка '%(a)s' на '%(b)s' не существует или не является папкой. Проверьте настройки и попробуйте снова.
uk: Тека '%(a)s' на '%(b)s' не існує або не є текою. Перевірте налаштування й спробуйте знову.

source: Authentication failed
ru: Сбой аутентификации
uk: Невдача автентифікації

source: A connection to '%s' was established, but authentication failed. Please verify the username and password and try again.
ru: Соединение с '%s' установлено, но аутенфикация не прошла. Проверьте имя пользователя и пароль.
uk: З’єднання з '%s' встановлено, але автентифікація не відбулася. Перевірте ім’я користувача та пароль.

source: A connection to '%s' could not be established
ru: Соединение с '%s' не может быть установлено
uk: З’єднання з '%s' не може бути встановлено

source: Error %(a)s: %(b)s
ru: Ошибка %(a)s: %(b)s
uk: Помилка %(a)s: %(b)s

source: The server '%s' is not responding
ru: Сервер '%s' не отвечает
uk: Сервер '%s' не відповідає

source: Please verify your settings and try again.
ru: Проверьте параметры и повторите ещё раз.
uk: Перевірте параметри й спробуйте ще раз.

source: Error: %s. Please verify your settings and try again.
ru: Ошибка: %s. Проверьте ваши настройки и попробуйте снова.
uk: Помилка: %s. Перевірте Ваші налаштування й спробуйте знову.

source: Unexpected error
ru: Произошла непредвиденная ошибка
uk: Сталася непередбачена помилка

source: Select file(s)
ru: Выберите файл(ы)

source: Configuration files (*.conf)
ru: Файлы конфигурации (*.conf)
uk: Файли конфігурації (*.conf)

source: File Exists
ru: Файл уже существует
uk: Файл вже існує

source: '%s.conf' already exists! Would you like to overwrite it?
ru: '%s.conf' уже существует. Заменить его?
uk: '%s.conf' вже існує. Замінити його?

source: Exported set `%(a)s' to `%(b)s'
ru: Экспортирован набор `%(a)s' в `%(b)s
uk: Екпортований набір `%(a)s' у `%(b)s

source: Export Sets
ru: Экспорт наборов
uk: Експорт наборів

source: Sets exported
ru: Наборы экспортированы
uk: Набори експортовані

source: The selected sets were exported successfully.
ru: Выбранные потоки успешно экспортированы.
uk: Обрані потоки успішно експортовані.

source: No set has been selected
ru: Нет выбранных наборов
uk: Немає вибраних наборів

source: You must select a set to duplicate.
ru: Вы должны выбрать набор для дублирования.
uk: Ви повинні вибрати набір для дублювання.

source: _copy
ru: _копирование
uk: _копіювання

source: Could not remove fwbackup's session autostart regkey: %s
ru: Невозможно удалить ключ реестра автозапуска сессии fwbackup '%s'

source: Could not remove fwbackup's session autostart file: %s
ru: Невозможно удалить файл автозапуска сессии fwbackups '%s'

source: Resetting preference '%(a)s' to 0
ru: Сброс настройки '%(a)s' в 0
uk: Скидання налаштування '%(a)s' у 0

source: Select a Folder
ru: Выбор папки
uk: Вибір теки

source: Missing information
ru: Отсутствует информация
uk: Інформація відсутня

source: Please enter a Pycron installation directory.
ru: Задайте папку установки Pycron.

source: Configuration not found
ru: Файл конфигурации не найден

source: The pycron configuration file was not found in the directory entered. Please ensure that pycron is installed in the selected installation folder and that it contains either a pycron configuration file or the sample pycron configuration.
ru: Файл конфигурации pycron не был найден в папке входа. Пожалуйста, убедитесь, что pycron установлен в выбранную папку установки, и что он содержит либо конфигурационный файл pycron, либо пример конфигурации pycron.

source: Please complete the host, username, folder and port fields.
ru: Задайте сервер, имя пользователя, папку и порт.
uk: Вкажіть сервер, ім’я користувача, теку та порт.

source: You must select a set to edit.
ru: Вы должны выбрать набор для редактирования.
uk: Ви повинні вибрати набір для редагування.

source: You must select a set to remove.
ru: Вы должны выбрать набор для удаления.
uk: Ви повинні вибрати набір для вилучення.

source: Delete backup set '%s'?
ru: Удалить набор резервирования '%s'?
uk: Вилучити набір резервування '%s'?

source: This action will permanently delete the backup set configuration. This action does not delete any existing backups or files.
ru: Это действие полностью удалит настройку набора резервирования, но не затронет существующих резервных копий или файлов.

source: An error occured while removing set `%(a)s': %(b)s
ru: Ошибка при удалении набора `%(a)s': %(b)s
uk: Помилка при вилученні набору `%(a)s': %(b)s

source: Could not remove backup set '%s'
ru: Невозможно удалить набор резервирования '%s'
uk: Неможливо вилучити набір резервування '%s'

source: Could not remove the automated backup schedule for set '%s'
ru: Не могу удалить расписание автоматического резервирования для набора '%s'
uk: Не можу вилучити розклад автоматичного резервування для набору '%s'

source: Removing set `%s'
ru: Удаление набора `%s'
uk: Вилучення набору `%s'

source: An unexpected error occured while attempting to obtain the selected set: %s
ru: Произошла непредвиденная ошибка при попытке получить выбранный набор: %s
uk: Сталася непередбачена помилка при спробі отримати вибраний набір: %s

source: You must select a set to restore.
ru: Вы должны выбрать набор для восстановления.
uk: Ви повинні вибрати набір для відновлення.

source: Please fill in the Folder field.
ru: Заполните поле Папка.
uk: Заповніть поле Тека.
