Repository: stewartadam/fwbackups
Catalog: po/*.po
Languages: ru, uk

source: Show tray icon
ru: Показывать иконку в системном лотке

source: Start minimized
ru: Запускать в свёрнутом виде

source: <b>Tray Options</b>
ru: <b>Параметры сист. лотка</b>

source: Always show debug messages in the log
ru: Всегда показывать сообщения дебагинга в журнале

source: Start fwbackups (minimized) when I login
ru: Запускать fwbackups (свернув) при каждом входе

source: Customize temporary directory
ru: Настроить временную папку

source: <b>Misc. Options</b>
ru: <b>Разное</b>

source: Pycron installation directory:
ru: Папка установки pycron:

source: <b>Windows-specific options</b>
ru: <b>Параметры только для ОС Windows</b>

source: Click to reset "Don't show me again" messages
ru: Нажмите для сброса сообщения "Больше не показывать"
uk: Натисніть для скидання повідомлення "Більше не показувати"

source: Configure Set
ru: Настроить набор
uk: Налаштувати набір

source: Paths
ru: Пути
uk: Шляхи

source: Destination Type:
ru: Тип назначения:
uk: Тип призначення:

source: Destination
ru: Назначение
uk: Призначення

source: <b>Day(s) of the Week</b>
ru: <b>Дни недели</b>

source: <b>Month(s)</b>
ru: <b>Месяц(ы)</b>

source: Please use the same syntax a crontab does to enter your settings. <i>To obtain examples and more information on crontab syntax, click 'Help'.</i>
ru: Используйте похожий синтаксис crontab при вводе ваших настроек. <i>Чтобы посмотреть примеры синтаксиса crontab нажмите 'Справка'.</i>

source: No field verification is performed on a manual field to test if the input is valid. Please make sure there are no errors.
ru: При ручном вводе не предусмотрена проверка на правильность заполнения полей. Убедитесь, что у вас нет ошибок.

source: <b>Day(s) of Month</b>
ru: <b>Дни месяца</b>

source: <b>Hour(s)</b>
ru: <b>Час(ы)</b>

source: <b>Minute(s)</b>
ru: <b>Минут(ы)</b>

source: Manual Configuration
ru: Ручная настройка
uk: Ручне налаштування

source: All Months
ru: Весь месяц
uk: Увесь місяць

source: Only during:
ru: Только в течении:
uk: Лише протягом:

source: From:
ru: С:
uk: З:

source: January February March April May June July August September October November December
ru: Январь Февраль Март Апрель Май Июнь Июль Август Сентябрь Октябрь Ноябрь Декабрь

source: To:
ru: До:
uk: До:

source: <b>Months</b>
ru: <b>Месяцы</b>
uk: <b>Місяці</b>

source: Only on:
ru: Только в:
uk: Лише у:

source: All days of the week
ru: Все дни недели
uk: Усі дні тижня

source: Sunday Monday Tuesday Wednesday Thurday Friday Saturday
ru: Воскресенья Понедельника Вторника Среды Четверга Пятницы Субботы

source: Sundays Mondays Tuesdays Wednesdays Thurdays Fridays Saturdays
ru: Воскресенье Понедельник Вторник Среда Четверг Пятница Суббота

source: <b>Days of the week</b>
ru: <b>Дни недели</b>
uk: <b>Дні тижня</b>

source: At:
ru: В:
uk: В:

source: All Hours
ru: Каждый час
uk: Кожну годину

source: <b>Hours</b>
ru: <b>Часы</b>
uk: <b>Години</b>

source: Only at:
ru: Только в:
uk: Лише у:

source: All Minutes
ru: Каждую минуту
uk: Кожну хвилину

source: <b>Minute</b>
ru: <b>Минута</b>
uk: <b>Хвилина</b>

source: Easy Configuration
ru: Быстрая настройка
uk: Швидке налаштування

source: <i>Tip: Your backup will run whenever <b>all</b> of the criteria below match the system time and date.</i>
ru: <i>Совет: Резервирование будет запущено при <b>каждом</b> совпадении параметров даты и времени системы.</i>

source: Times
ru: Время
uk: Час

source: Backups are incremental
ru: Использовать нарастающее резервирование
uk: Використовувати наростаюче резервування

source: Set is enabled
ru: Набор включен
uk: Набір увімкнений

source: Include subfolders
ru: Включая вложенные папки
uk: Включаючи вкладені теки

source: Number of old backups to keep:
ru: Число сохраняемых старых резервных копий:
uk: Число старих резервних копій, що зберігаються:

source: <i>Tip: </i>0<i> makes a new backup always replace an older one. This option is unavailable with incremental backups.</i>
ru: <i>Совет: </i>0<i> будет заменять старые резервные копии новыми. Этот параметр неприменим при инкрементном резервировании.</i>

source: Options (Simple)
ru: Основные опции
uk: Основні опції

source: Command to run before backup:
ru: Команда для запуска перед резервированием:
uk: Команда для запуску перед резервуванням:

source: Command to run after backup:
ru: Команда для запуска после резервирования:
uk: Команда для запуску після резервування:

source: <i>Tip: The following tokens may be used in the commands: [destination], [set], [date], [backup], [remote_host], [remote_port], [remote_username], [remote_password] For a description of each, see the user manual.</i>
ru: <i>Совет: Следующие маркеры могут быть использованы в командах: [destination], [set], [date], [backup], [remote_host], [remote_port], [remote_username], [remote_password] По описанию каждого смотрите руководство пользователя.</i>

source: Options (Advanced)
ru: Дополнительные опции
uk: Додаткові опції

source: <b>Name:</b>
ru: <b>Имя:</b>
uk: <b>Ім’я:</b>

source: fwbackups Initializing...
ru: Инициализация fwbackups...

source: A feature-rich user backup program
ru: Программа для резервного копирования с продвинутыми возможностями

source: <span size="small">Please wait while fwbackups initializes.</span>
ru: <span size="small">Дождитесь инициализации fwbackups.</span>

source: Bug Report
ru: Отправить сообщение об ошибке
uk: Відіслати повідомлення про ваду

source: <span size="larger" weight="bold">Sorry!</span>
ru: <span size="larger" weight="bold">Извините!</span>
uk: <span size="larger" weight="bold">Вибачте!</span>

source: fwbackups has run into an unexpected error. You may continue using the program, however it is recommended you quit and open fwbackups again.
ru: fwbackups запустился с неустановленной ошибкой. Вы можете продолжить использование программы, но мы рекомендуем закрыть её и попробовать запустить снова.
uk: fwbackups запустився з невстановленою помилкою. Ви можете продовжити використання проґрами, але ми радимо закрити його та спробувати запустити знову.

source: Traceback Here
ru: Здесь Traceback

source: _Details
ru: _Подробности
uk: _Деталі

source: Canceling the current operation!
ru: Отменяется текущая операция!
uk: Скасовується поточна операція!

source: Stopping process with ID %s
ru: Остановка процесса с ID %s
uk: Зупинка процесу з ID %s

source: Could not stop process %(a)s: %(b)s
ru: Невозможно остановить процесс %(a)s: %(b)s

source: The operation has been cancelled.
ru: Операция была отменена.
uk: Операція була скасована.

source: Error handling file `%s'
ru: Ошибка обработки файла `%s'
uk: Помилка опрацювання файлу `%s'

source: Output: %s
ru: Вывод: %s
uk: Вивід: %s

source: Destination folder `%s' exists
ru: Папка назначения `%s' уже существует
uk: Тека призначення `%s' вже існує

source: Created destination folder `%s'
ru: Создана папка назначения `%s'
uk: Створена тека призначення `%s'

source: The destination folder `%(a)s' could not be created: %(b)s
ru: Папка назначения `%(a)s' не может быть создана: %(b)s
uk: Тека призначення `%(a)s' не може бути створена: %(b)s

source: You do not have read and write permissions on the destination `%s' - if you backed up system files, this operation may fail.
ru: У вас нет прав на чтение/запись в назначении `%s - если вы выполните резервное копирование системных файлов, то эта операция может завершиться неудачей.
uk: В Вас немає прав на читання/запис у призначенні `%s - якщо Ви виконаєте резервне копіювання системних файлів, то ця операція може завершитися невдачею.

source: rpm - Package list
ru: rpm - список пакетов
uk: rpm - перелік пакунків

source: Pacman - Package list
ru: Pacman - список пакетов
uk: Pacman - перелік пакунків

source: dpkg - Package list
ru: dpkg - список пакетов
uk: dpkg - перелік пакунків

source: Disk Information
ru: Сведения о диске
uk: Відомості про диск

source: Attempting to connect to server %s...
ru: Попытка соединения с сервером %s...
uk: Спроба з’єднання з сервером %s...

source: Attempt to connect succeeded.
ru: Соединение прошло успешно.
uk: З’єднання відбулося успішно.

source: The backup destination was either not found or it cannot be written to due to insufficient permissions.
ru: Назначение для резервирования либо не было найдено, либо не может быть записано из-за недостаточных прав.
uk: Призначення для резервування або не було знайдено, або не може бути записане з-за недоліку прав.

source: A connection was established, but authentication failed. Please verify the username and password and try again.
ru: Соединение установлено, но аутенфикация не прошла. Проверьте имя пользователя и пароль.
uk: З’єднання встановлено, але автентифікація не відбулася. Перевірте ім’я користувача та пароль.

source: A connection to the server could not be established. Error %(a)s: %(b)s
ru: Соединение с сервером не может быть выполнено. Ошибка %(a)s: %(b)s
uk: З’єднання з сервером не може бути виконано. Помилка %(a)s: %(b)s

source: A connection to the server has timed out. Please verify your settings and try again.
ru: Соединение с сервером достигло таймаута. Пожалуйста, проверьте ваши настройки и попробуйте снова.
uk: З’єднання з сервером досягло таймауту. Будь ласка, перевірте Ваші налаштування та спробуйте знову.

source: A connection to the server could not be established because an error occurred: %s
ru: Соединение с сервером не установлено из-за ошибки: %s
uk: З’єднання з сервером не встановлено з-за помилки: %s

source: Using %s on Windows: Cancel function will only take effect after a path has been completed.
ru: Используйте %s в Windows: Функция отмены будет иметь эффект только после завершения пути.
uk: Використовуйте %s у Windows: Функція скасування буде мати ефект лише після завершення шляху.

source: Backing up path %(a)i/%(b)i: %(c)s
ru: Резервировать путь %(a)i/%(b)i: %(c)s
uk: Резервувати шлях %(a)i/%(b)i: %(c)s

source: Running command: nice -n %(a)i %(b)s '%(c)s'
ru: Запуск команды: nice -n %(a)i %(b)s '%(c)s'
uk: Запуск команди: nice -n %(a)i %(b)s '%(c)s'

source: Starting subprocess with PID %s
ru: Запуск подпроцесса с PID %s
uk: Запуск підпроцесу з PID %s

source: Subprocess with PID %(a)s exited with status %(b)s
ru: Подпроцесс с PID %(a)s завершился со статусом %(b)s
uk: Підпроцес з PID %(a)s завершився зі статусом %(b)s

source: Process exited with status %(a)s. Errors: %(b)s
ru: Процесс завершен со статусом %(a)s. Ошибка: %(b)s
uk: Процес завершено зі статусом %(a)s. Помилка: %(b)s

source: Adding path `%s' to the archive
ru: Добавление пути `%s' в архив
uk: Додавання шляху `%s' у архів

source: Using %s: Must backup all paths at once - Progress notification will be disabled.
ru: Используйте %s: Должно зарезервировать все пути за раз - вывод прогресса операции отключен.
uk: Використовуйте %s: Має зарезервувати усі шляхи за раз - вивід поступу операції викнений.

source: Running command: nice -n %(a)i %(b)s %(c)s
ru: Запуск команды: nice -n %(a)i %(b)s %(c)s
uk: Запуск команди: nice -n %(a)i %(b)s %(c)s

source: Path %s is missing or cannot be read and will be excluded from the backup.
ru: Путь %s отсутствует или не может быть прочитан и будет исключен из резервирования.
uk: Шлях %s відсутній або не може бути прочитаний й буде виключений з резервування.

source: Running command: nice -n %(a)i %(b)s %(c)s '%(d)s'
ru: Запуск команды: nice -n %(a)i %(b)s %(c)s '%(d)s'
uk: Запуск команди: nice -n %(a)i %(b)s %(c)s '%(d)s'

source: Sending files to server via SFTP
ru: Посылка файлов на сервер через SFTP
uk: Посилання файлів на сервер через SFTP

source: Could not send file(s) or folder to server:
ru: Невозможно послать файл(ы) или папку на сервер:
uk: Неможливо послати файл(и) або теку на сервер:

source: This function is designed to be subclassed
ru: Эта функция спроектирована как подкласс
uk: Ця функція спроєктована як підкляс

source: Starting one-time backup operation
ru: Запуск разового резервирования
uk: Запуск разового резервування

source: OneTime
ru: Разовое
uk: Разове

source: There are no paths to backup!
ru: Нет путей для резервирования!
uk: Немає шляхів для резервування!

source: `%s' exists and will be overwritten.
ru: `%s' существует и будет перезаписан.
uk: `%s' існує й буде перезаписаний.

source: Finished one-time backup
ru: Завершено разовое резервирование
uk: Закінчено разове резервування

source: Starting automatic backup operation of set `%s'
ru: Запуск автоматического резервирования для набора `%s'
uk: Запуск автоматичного резервування для набору `%s'

source: Executing '%s' command
ru: Выполнение команды '%s'
uk: Виконання команди '%s'

source: Command returned with a non-zero exit status!
ru: Команда вернула ненулевой статус завершения!
uk: Команда повернула не нульовий статус завершення!

source: Removing old backup `%(a)s' on %(b)s
ru: Удаление старой резервной копии: `%(a)s' на %(b)s
uk: Вилучення старої резервної копії: `%(a)s' на %(b)s

source: Removing old backup `%s'
ru: Удаление старой резервной копии `%s'
uk: Вилучення старої резервної копії `%s'

source: Moving `%s' to `%s'
ru: Перемещение `%s' в `%s'
uk: Переміщення `%s' у `%s'

source: `%s' is not an rsync backup - removing.
ru: `%s' не является резервной копией rsync - удаляем.
uk: `%s' не є резервною копією rsync - вилучаємо.

source: Finished automatic backup operation of set '%s'
ru: Завершено автоматическое резервирование для набора '%s'
uk: Закінчено автоматичне резервування для набору '%s'

source: Starting restore operation
ru: Старт операции восстановления
uk: Початок операції відновлення

source: Attempting to connect to server
ru: Попытка соединения с сервером
uk: Спроба з’єднання з сервером

source: The restore source was either not found or it cannot be read due to insufficient permissions.
ru: Восстанавливаемый источник либо не был найден, либо не может быть прочитан из-за недостаточных прав.
uk: Відновлюване джерело або не було знайдено, або не може бути прочитане з-за недоліку прав.

source: Receiving files from server
ru: Приём файлов с сервера
uk: Приймання файлів з сервера

source: Could not receive file from server: %s
ru: Невозможно принять файлы с сервера: %s
uk: Неможливо прийняти файли з сервера: %s

source: Finished restore operation
ru: Операция восстановления закончена
uk: Операція відновлення закінчена

source: Source `%s' is not a file or folder!
ru: Источник `%s' не файл или папка!
uk: Джерело `%s' не файл чи тека!

source: Source `%s' is not an archive!
ru: Источник `%s' не архив!
uk: Джерело `%s' не архів!

source: Source `%s' is not a folder
ru: Источник `%s' не папка
uk: Джерело `%s' не тека

source: Could not create configuration folder `%s':
ru: Не возможно создать папку конфигурации `%s':
uk: Неможливо створити теку конфігурації `%s':

source: You do not have read and write permissions on folder `%s'.
ru: У вас нет прав на чтение/запись папки `%s'.
uk: В Вас немає прав на читання/запис теки `%s'.

source: Key %s of is not a dictionary of options
ru: Ключ %s не в словаре вариантов
uk: Ключ %s не у словнику варіянтів

source: Set '%s' failed to pass section validation
ru: Набор '%s' не прошёл проверку секции
uk: Набір '%s' не пройшов перевірку секції

source: '%(a)s' is not a set configuration file.
ru: '%(a)s' не является файлом конфигурации набора.
uk: '%(a)s' не є файлом конфігурації набору.

source: Configuration section 'General' in the set configuration '%s' failed to validate
ru: Секция 'General' в файле конфигурации набора '%s' не прошла проверку
uk: Секція 'General' у файлі конфігурації набору '%s' не пройшла перевірку

source: Configuration section 'Times' in the set configuration '%s' failed to validate
ru: Секция 'Time' в файле конфигурации набора '%s' не прошла проверку
uk: Секція 'Time' у файлі конфігурації набору '%s' не пройшла перевірку

source: Unknown option key '%(a)s' present in set configuration '%(b)s'
ru: Неизвестный ключ '%(a)s' в конфигурации набора '%(b)s'
uk: Невідомий ключ '%(a)s' у конфігурації набору '%(b)s'

source: Configuration section 'Options' in set configuration '%(a)s' failed to validate: Missing options '%(b)s'
ru: Секция 'Options' в файле конфигурации набора '%(a)s' не прошла проверку: Пропущен параметр '%(b)s'
uk: Секція 'Options' у файлі конфігурації набору '%(a)s' не пройшла перевірку: Пропущено параметр '%(b)s'

source: One-time configuration failed to pass section validation
ru: Разовое резервирование не прошло проверку раздела
uk: Разове резервування не пройшло перевірку розділу

source: '%(a)s' is not a one-time configuration file.
ru: '%(a)s' не является файлом конфигурации разового резервирования
uk: '%(a)s' не є файлом конфігурації разового резервування

source: Configuration section 'General' in the one-time configuration file failed to validate
ru: Секция 'General' файла конфигурации разового резервирования не прошла проверку
uk: Секція 'General' файлу конфігурації разового резервування не пройшла перевірку

source: Unknown option key '%s' present in one-time backup configuration file
ru: Неверный параметр '%s' в файле конфигурации разового резервирования
uk: Неправильний параметр '%s' у файлі конфігурації разового резервування

source: Configuration section 'Options' in the one-time backup configuration file failed to validate: Missing options '%s'
ru: Секция 'Options' файла конфигурации разового резервирования не прошла проверку: Отсутствует параметр '%s'
uk: Секція 'Options' файлу конфігурації разового резервування не пройшла перевірку: Відсутній параметр '%s'

source: Restore configuration failed to pass section validation
ru: Конфигурация восстановления не прошла проверку секции
uk: Конфігурація відновлення не пройшла перевірку секції

source: '%(a)s' is not a restore configuration file.
ru: '%(a)s' не является файлом конфигурации восстановления
uk: '%(a)s' не є файлом конфігурації відновлення

source: Configuration section 'General' in the restore configuration file failed to validate
ru: Секция 'General' файла конфигурации восстановления не прошла проверку
uk: Секція 'General' файлу конфігурації відновлення не пройшла перевірку

source: Unknown option key '%s' present in restore configuration file
ru: Неизвестный ключ '%s' в файле конфигурации восстановления
uk: Невідомий ключ '%s' у файлі конфігурації відновлення

source: Configuration section 'Options' in the restore configuration file failed to validate: Missing options '%s'
ru: Секция 'Options' файла конфигурации восстановления не прошла проверку: Пропущен параметр '%s'
uk: Секція 'Options' файлу конфігурації відновлення не пройшла перевірку: Пропущено параметр '%s'

source: Preferences failed to pass section validation
ru: Файл настроек не прошел проверку секции
uk: Файл налаштувань не пройшов перевірку секції

source: '%(a)s' is not a fwbackups preferences file.
ru: '%(a)s' не является файлом настроек fwbackups.

source: Configuration section 'General' in the preferences file failed to validate
ru: Секция 'General' файла настроек не прошла проверку
uk: Секція 'General' файлу налаштувань не пройшла перевірку

source: Unknown option key '%s' present in preferences file
ru: Неизвестный ключ '%s' обнаружен в файле настроек
uk: Невідомий ключ '%s' виявлено у файлі налаштувань

source: Configuration section 'Options' in the preferences file failed to validate: Missing options '%s'
ru: Секция 'Options' файла настроек не прошла проверку: Пропущен параметр '%s'
uk: Секція 'Options' файлу налаштувань не пройшла перевірку: Пропущено параметр '%s'

source: Unable to clean user crontab!
ru: Невозможно очистить crontab пользователя!

source: Could not locate the pycron or the sample pycron configuration in %s
ru: Не обнаружен pycron или пример файла конфигурации pycron в %s

source: Could not locate the pycron or the sample pycron crontab file in %s
ru: Не обнаружен pycron или пример файла pycron crontab в %s

source: Could not set up the logger: %s
ru: Невозможно настроить журналирование: %s
uk: Неможливо налаштувати журналювання: %s

source: `%s' is not a file, folder or link! Skipping.
ru: `%s' это не файл, папка или ссылка! Пропускается.
uk: `%s' це не файл, тека чи посилання! Пропускається.

source: Could not copy some files due to errors:
ru: Невозможно скопировать некоторые файлы из-за ошибки:
uk: Неможливо скопіювати деякі файли з-за помилки:

source: `%s' isn't a file, folder or link! Skipping.
ru: `%s' это не файл, папка или ссылка! Пропускается.
uk: `%s' це не файл, тека чи посилання! Пропускається.

source: Couldn't copy some files due to errors:
ru: Невозможно скопировать некоторые файлы из-за ошибки:
uk: Неможливо скопіювати деякі файли з-за помилки:

source: CRITICAL
ru: КРИТИЧНО
uk: КРИТИЧНО

source: ERROR
ru: ОШИБКА
uk: ПОМИЛКА

source: WARNING
ru: ПРЕДУПРЕЖДЕНИЕ
uk: ПОПЕРЕДЖЕННЯ

source: Previous log messages
ru: Предыдущие сообщения журнала
uk: Попередні повідомлення журналу

source: No previous log messages to display
ru: Нет сообщений предыдущего журнала для отображения
uk: Немає повідомлень попереднього журналу для відображення

source: Current session's log messages
ru: Журнал сообщений текущей сессии
uk: Журнал повідомлень поточної сесії

source: Access
ru: Доступ
uk: Доступ

source: Path
ru: Путь
uk: Шлях

source: Choose file(s)
ru: Выберите файл(ы)
uk: Виберіть файл(и)

source: Choose folder(s)
ru: Выберите папку(и)
uk: Виберіть теку(и)

source: Please select a path before choosing an action.
ru: Выберите путь перед заданием действия.
uk: Виберіть шлях перед вказуванням дії.

source: Export
ru: Экспорт
uk: Експорт

source: Set
ru: Набор
uk: Набір
