Repository: stewartadam/fwbackups
Catalog: po/*.po
Languages: ru, uk

source: Please fill in the Host, Username, Port and Folder fields.
ru: Задайте сервер, имя пользователя, папку и порт.
uk: Вкажіть сервер, ім’я користувача, теку та порт.

source: Please complete all of the host, username, folder and port fields.
ru: Задайте все поля: сервер, имя пользователя, папку и порт.
uk: Вкажіть усі поля: сервер, ім’я користувача, тека та порт.

source: Log cleared
ru: Журнал очищен
uk: Журнал очищено

source: Clear the old log entries?
ru: Удалить старые записи журнала?
uk: Вилучити старі записи журналу?

source: This action will permanently remove all log entries.
ru: Это действие полностью удалит все записи журнала.
uk: Ця дія повністю вилучить усі записи журналу.

source: Log saved to file `%s'
ru: Журнал записан в файл '%s'
uk: Журнал збережено у файл '%s'

source: Previous backups could not be found
ru: Невозможно найти предыдущую резервную копию
uk: Неможливо знайти попередню резервну копію

source: The destination folder for set '%s' was not found.
ru: Папка назначения для набора '%s' не найдена.
uk: Тека призначення для набору '%s' не знайдена.

source: fwbackups was unable to authenticate on the remote server. Please verify the username and password for set '%s' and try again.
ru: fwbackups не может аутенфицироваться на удалённом сервере. Проверьте имя пользователя и пароль для набора '%s' и попробуйте снова.
uk: fwbackups не може автентифікуватися на віддаленому сервері. Перевірте ім’я користувача і пароль для набору '%s' й спробуйте знову.

source: Connection failed
ru: Сбой подключения
uk: З’єднання не вдалося

source: A connection to the server could not be established: Error %(a)s: %(b)s Please verify your settings and try again.
ru: Соединение с сервером не установлено: Ошибка %(a)s: %(b)s Проверьте ваши настройки и попробуйте снова.
uk: З’єднання з сервером не встановлено: Помилка %(a)s: %(b)s Перевірте Ваші налаштування та спробуйте знову.

source: Remote server is not responding
ru: Удалённый сервер не доступен
uk: Віддалений сервер не доступний

source: A connection to the server could not be established because an error occurred: %s Please verify your settings and try again.
ru: Соединение с сервером не установлено из-за ошибки: %s Проверьте ваши настройки и попробуйте снова.
uk: З’єднання з сервером не встановлено з-за помилки: %s Перевірте Ваші налаштування й спробуйте знову.

source: Error obtaining file listing in destination %(a)s: %(b)s
ru: Ошибка получения списка файлов в назначении %(a)s: %(b)s
uk: Помилка отримання переліку файлів у призначенні %(a)s: %(b)s

source: Could not get a list of old backups for set '%s'
ru: Невозможно получить список старых резервных копий для набора '%s'
uk: Неможливо отримати перелік старих резервних копій для набору '%s'

source: If the destination is on removable media such as an external hard disk, please attach it and try again.
ru: Если назначение является съёмным носителем, таким как внешний жёсткий диск, подключите его и попробуйте снова.
uk: Якщо призначення є знімним носієм, таким як зовнішній жорсткий диск, під’єднайте його та спробуйте знову.

source: No backups found
ru: Не найдено резервных копий
uk: Не знайдено резервних копій

source: Automated restore not supported
ru: Автоматическое восстановление не поддерживается

source: This backup set cannot be automatically restored because restoration of Archive backups has not been implemented for systems with Python 2.4. Please see the user guide for details on manual restoration.
ru: Этот набор резервирования не может быть автоматически восстановлен, потому что восстановление из архива не доступно на системах с Python 2.4. Прочитайте руководство пользователя по ручному восстановлению.

source: Please select a backup date.
ru: Выберите дату резервирования.
uk: Оберіть дату резервування.

source: The backup set '%s' does not have any stored backups yet! Choose another set, or alternatively choose a different restore source.
ru: Набор восстановления '%s' не имеет сохранённых копий. Выберите другой набор или другой источник восстановления.
uk: Набір відновлення '%s' не має збережених копій. Виберіть інший набір або інше джерело відновлення.

source: Restore source
ru: Восстановить источник
uk: Відновити джерело

source: Please enter the location of the local archive.
ru: Задайте расположение локального архива.
uk: Вкажіть розташування локального архіву.

source: Wrong file type
ru: Неверный тип файла
uk: Хибний тип файлу

source: The file you selected is not a supported archive. Supported archives types are tar with no, gzip or bzip2 compression.
ru: Файл, выбранный вами, не является поддерживаемым архивом. Типы поддерживаемых архивов: tar без сжатия, gzip или bzip2 сжатие.
uk: Файл, вибраний Вами, не є підтримуваним архівом. Типи підтримуваних архівів: tar без стиснення, gzip або bzip2 стиснення.

source: Please enter the location of the local folder.
ru: Задайте расположение локальной папки.
uk: Вкажіть розташування локальної теки.

source: Invalid set name
ru: Неверное имя набора
uk: Хибне ім’я набору

source: Please enter a set name.
ru: Введите имя набора.
uk: Уведіть ім’я набору.

source: 'temporary_name' is a reserved name. Please choose another name for the set.
ru: 'temporary_name' - это зарезервированное имя. Выберите другое имя для набора.
uk: 'temporary_name' - це зарезервоване ім'я. Виберіть інше ім’я для набору.

source: Overwrite settings for set '%s'?
ru: Перезаписать настройки для набора '%s'?
uk: Перезаписати налаштування для набору '%s'?

source: This will overwrite the stored settings with the current ones. Are you sure you want to continue?
ru: Это действие перезапишет сохранённые настройки на текущие. Вы хотите продолжить?
uk: Ця дія перезапише збережені налаштування на поточні. Ви бажаєте продовжити?

source: Error parsing configuration file
ru: Ошибка разбора файла конфигурации
uk: Помилка аналізу файлу конфігурації

source: fwbackups will using the default times instead.
ru: fwbackups будет использовать время по умолчанию.
uk: fwbackups буде використовувати типовий час.

source: Unknown destination type `%s'
ru: Неизвестный тип назначения `%s'
uk: Невідомий тип призначення `%s'

source: Error creating the automated backup schedules
ru: Ошибка создания расписания автоматического резервирования
uk: Помилка створення розкладу автоматичного резервування

source: The crontab could not be written because an error occured: %s
ru: Сrontab не может быть записан из-за ошибки: %s
uk: Сrontab не може бути записаний з-за помилки: %s

source: Parsing configuration files
ru: Разбор файла конфигурации
uk: Розбір файлу конфігурації

source: Refusing to parse file `%s': configuration files must end in `.conf'
ru: Сбой разбора файла `%s': файл конфигурации должен иметь расширение `.conf'
uk: Збій розбору файлу `%s': файл конфігурації повинен мати розширення `.conf'

source: Renaming set `%(a)s' to `%(b)s
ru: Переименовать набор `%(a)s' в `%(b)s
uk: Перейменувати набір `%(a)s' на `%(b)s

source: Renaming set `%(a)s' to `%(b)s failed: %(c)s
ru: Переименование набора `%(a)s' в `%(b)s не удалось: %(c)s
uk: Перейменування набору `%(a)s' на `%(b)s не вдалося: %(c)s

source: Could not rename set '%(a)s' to '%(b)s'
ru: Невозможно переименовать набор '%(a)s' в '%(b)s'
uk: Неможливо перейменувати набір '%(a)s' на '%(b)s'

source: Creating set `%s'
ru: Создаётся набор `%s'
uk: Створюється набір `%s'

source: Saving changes to set `%s'
ru: Запись изменений в набор `%s'
uk: Запис змін у набір `%s'

source: Your set configuration changes were saved, but fwbackups was unable to save the backup scheduling information to the crontab. If you are using manual times entry, please verify that all five fields are using the correct syntax.
ru: Изменение настроек вашего набора были сохранены, но fwbackups не смог сохранить расписание резервирования в crontab. Если вы используете ручное задание времени, проверьте, чтобы все поля имели верный синтаксис.
uk: Зміни налаштувань Вашого набору були збережені, але fwbackups не зміг зберегти розклад резервування у crontab. Якщо Ви використовуєте ручне вказування часу, перевірте, аби усі поля мали вірний синтаксис.

source: [%(a)i/%(b)i] Backing up: %(c)s
ru: [%(a)i/%(b)i] Резервирование: %(c)s
uk: [%(a)i/%(b)i] Резервування: %(c)s

source: [%(a)i/%(b)i] Backing up files... Please wait
ru: [%(a)i/%(b)i] Резервируются файлы... Подождите
uk: [%(a)i/%(b)i] Резервуються файли... Зачекайте

source: Cleaning old backups
ru: Очистка старых резервных копий
uk: Очищення старих резервних копій

source: Sending files to remote server
ru: Отправка файлов на удалённый сервер
uk: Відсилання файлів на віддалений сервер

source: Executing user command
ru: Выполнение команды пользователя
uk: Виконання команди користувача

source: You must select to initiate a manual set backup.
ru: Вы должны выбрать для начала заданный вручную набор.
uk: Ви повинні вибрати для початку вказаний вручну набір.

source: Initializing
ru: Инициализация
uk: Ініціялізація

source: Status
ru: Статус

source: Starting a set backup operation of '%(a)s'
ru: Запуск операции резервирования для набора '%(a)s'
uk: Запуск операції резервування для набору '%(a)s'

source: Please wait...
ru: Пожалуйста, подождите...
uk: Зачекайте...

source: Working
ru: Работает
uk: Працює

source: <span color="Red">Error</span>
ru: <span color="Red">Ошибка</span>
uk: <span color="Red">Помилка</span>

source: An error occurred while initializing the backup operation: %s
ru: Ошибка при инициализации операции резервирования: %s
uk: Помилка при ініціялізації операції резервування: %s

source: Error initializing backup
ru: Ошибка инициализации резервной копии
uk: Помилка ініціялізації резервної копії

source: Finished the automatic backup operation of set `%(a)s'
ru: Завершено автоматическое резервирование для набора `%(a)s'
uk: Завершено автоматичне резервування для набору `%(a)s'

source: <span color="dark green">Operation complete</span>
ru: <span color="dark green">Операция завершена</span>
uk: <span color="dark green">Операція завершена</span>

source: An error occured while performing the automatic backup operation of set `%(a)s'
ru: Ошибка при выполнении автоматического резервирования для набора `%(a)s'
uk: Помилка при виконанні автоматичного резервування для набору `%(a)s'

source: The automatic backup operation of set `%(a)s' was cancelled
ru: Операция автоматического резервирования для набора `%(a)s' отменена
uk: Операція автоматичного резервування для набору `%(a)s' скасована

source: <span color="red">Operation cancelled</span>
ru: <span color="red">Операция отменена</span>
uk: <span color="red">Операція скасована</span>

source: Operation cancelled
ru: Операция была отменена.
uk: Операція була скасована

source: Cancelling...
ru: Отмена...
uk: Скасування...

source: Starting a one-time backup operation
ru: Запуск разового резервирования
uk: Запуск разового резервування

source: Finished the one-time backup operation
ru: Окончание разового резервирования
uk: Кінець разового резервування

source: An error occured while performing the one-time backup operation
ru: Ошибка при выполнении операции разового резервирования
uk: Помилка при виконанні операції разового резервування

source: The one-time backup operation was cancelled
ru: Операция разового резервирования была отменена.
uk: Операція разового резервування була скасована.

source: Receiving files from remote server
ru: Приём файлов с удалённого сервера
uk: Приймання файлів з віддаленого сервера

source: Restoring: %s
ru: Восстановление: %s
uk: Відновлення: %s

source: Starting a restore operation
ru: Старт операции восстановления
uk: Початок операції відновлення

source: There was an error while performing the restore! Enable debug messages for more information.
ru: Ошибка при выполнении восстановления! Включите сообщения дебаггинга для получения большей информации.
uk: Помилка при виконанні відновлення! Увімкніть повідомлення дебагінгу для отримання докладнішої інформації.

source: An error occurred while initializing the restore operation: %s
ru: Ошибка при инициализации операции восстановления: %s
uk: Помилка при ініціялізації операції відновлення: %s

source: Error initializing restore operation
ru: Ошибка инициализации операции восстановления
uk: Помилка ініціялізації операції відновлення

source: Finished the restore operation
ru: Операция восстановления завершена
uk: Операція відновлення закінчена

source: An error occured while performing the restore operation
ru: Ошибка при выполнении операции восстановления
uk: Помилка при виконанні операції відновлення

source: The restore operation was cancelled
ru: Операция восстановления была отменена.
uk: Операція відновлення була скасована.

source: Show this program's version and exit
ru: Вывести версию установленной программы и закончить работу

source: Show this help message and exit
ru: Показать это сообщение и закончить работу

source: print log messages to the terminal. Use this option twice
ru: Вывод сообщений журнала на терминал. Используйте этот параметр дважды

source: start GUI minimized in the system tray
ru: Сворачивать программу в системный лоток

source: To start, click one of the buttons on the above or use the menus.
ru: Для запуска нажмите на указанные кнопки или используйте меню.
uk: Для запуску натисніть на вказані кнопки або використовуйте меню.

source: Please do not forget to check your fwbackups log regularly to be informed about any errors and/or failed backup runs.
ru: Не забывайте регулярно проверять журнал fwbackups на предмет наличия сообщений об ошибках и/или сбоях резервирования.

source: [ set by runapp.py ]
ru: [ набор через runapp.py ]

source: <b>Welcome</b>
ru: <b>Добро пожаловать</b>
uk: <b>Ласкаво просимо</b>

source: <i>Not Loaded</i>
ru: <i>Не загружен</i>
uk: <i>Не завантажений</i>

source: Total backup sets:
ru: Всего наборов резервирования:
uk: Усього наборів резервування:

source: Failed backup runs:
ru: Ошибка запуска резервирования:
uk: Помилка запуску резервування:

source: <b>Status</b>
ru: <b>Статус</b>
uk: <b>Статус</b>

source: <span size="large" weight="bold">Overview</span>
ru: <span size="large" weight="bold">Обзор</span>

source: _New Set
ru: _Новый набор

source: Ed_it Set
ru: Редактировать набор

source: _Delete Set
ru: Удалить набор

source: _Backup Set Now
ru: _Резервировать сейчас

source: Re_store Set
ru: Восстановить набор

source: _Finish
ru: _Готово
uk: _Виконано

source: Status:
ru: Статус:
uk: Стан:

source: Backup progress:
ru: Прогресс резервирования:
uk: Поступ резервування:

source: <span size="large" weight="bold">Backups Sets</span>
ru: <span size="large" weight="bold">Наборы резервирования</span>

source: _Add File(s)
ru: _Добавить файл(ы)

source: _Add Folder(s)
ru: _Добавить папку(и)

source: Local folder Remote folder (SSH)
ru: Локальная папка Удалённая папка (SSH)

source: _Browse...
ru: _Обзор...

source: Folder:
ru: Папка:
uk: Тека:

source: /folder
ru: /папка
uk: /тека

source: Host:
ru: Сервер:
uk: Хост:

source: Username:
ru: Имя пользователя:
uk: Ім’я користувача:

source: Password:
ru: Пароль:
uk: Пароль:

source: _Test Settings
ru: _Тест настроек
uk: _Тест налаштувань

source: Hide password
ru: Скрыть пароль
uk: Приховати пароль

source: Port:
ru: Порт:
uk: Порт:

source: Destination type:
ru: Тип назначения:
uk: Тип призначення:

source: Archive (files and folders are packed into a tar archive)
ru: Архив (файлы и папки будут запакованы в tar архив)
uk: Архів (файли та теки будуть запаковані у tar архів)

source: Direct copy of the files and folders
ru: Прямое копирование файлов и папок
uk: Пряме копіювання файлів та тек

source: Compress archive using
ru: Упаковать в архив используя
uk: Запакувати у архів використовуючи

source: gzip: fast, lightweight bzip2: slower, more efficient
ru: gzip: быстро, не требует ресурсов bzip2: медленнее, большее сжатие

source: <b>Backup Format</b>
ru: <b>Формат резервирования</b>
uk: <b>Формат резервування</b>

source: Enabled
ru: Включен
uk: Увімкнений

source: Recursive
ru: Рекурсивно
uk: Рекурсивно

source: Print installed packages to a text file
ru: Вывод установленных пакетов в файл
uk: Вивід встановлених пакунків у файл

source: Print disk geometry information to a file
ru: Вывод геометрии диска в файл
uk: Вивід геометрії диску у файл

source: Include hidden files
ru: Включая скрытые файлы
uk: Включаючи приховані файли

source: Handle sparse files efficiently
ru: Эффективная поддержка разреженных файлов
uk: Ефективна підтримка розріджених файлів

source: Follow links
ru: Следовать по ссылкам
uk: Йти за посиланнями

source: <b>Backup Options</b>
ru: <b>Параметры резервирования</b>
uk: <b>Параметри резервування</b>

source: Exclude from backup: (newline separated)
ru: Исключить из копии: (новый пункт в новой строке)
uk: Виключити з копії: (новий пункт у новому рядку)

source: Nice value of backup process:
ru: Значение nice для процесса резервирования:
uk: Значення nice для процесу резервування:

source: <b>Advanced Options</b>
ru: <b>Дополнительно</b>
uk: <b>Додатково</b>

source: _Back
ru: _Назад

source: _Next
ru: _Следующий

source: _Start Backup
ru: _Запуск резервирования

source: <span size="large" weight="bold">One-Time Backup</span>
ru: <span size="large" weight="bold">Разовое резервирование</span>

source: _Save to File
ru: _Сохранить в файл
uk: _Зберегти у файл

source: <span size="large" weight="bold">Log Viewer</span>
ru: <span size="large" weight="bold">Просмотр журнала</span>

source: Overview
ru: Обзор
uk: Огляд

source: Backup Sets
ru: Наборы

source: One-Time Backup
ru: Разовая копия
uk: Разова копія

source: Log Viewer
ru: Журнал
uk: Журнал

source: Restore
ru: Восстановить
uk: Відновити

source: _File
ru: _Файл

source: Create a new backup set
ru: Создать новый набор резервирования

source: Import a set from a .conf file
ru: Импортировать набор из .conf файла

source: _Import Sets
ru: _Импорт наборов

source: Export one or more sets to .conf files
ru: Экспортировать один или несколько наборов в .conf файл

source: E_xport Sets
ru: _Экспорт наборов

source: _Edit
ru: _Править

source: Edit the selected backup set
ru: Редактировать выбранный набор

source: _Edit Set
ru: _Править набор

source: Remove the selected backup set
ru: Удалить выбранный набор резервирования

source: Duplicate the selected backup set
ru: Скопировать выбранный набор

source: D_uplicate Set
ru: _Дублировать набор

source: _View
ru: _Вид

source: Switch to Overview
ru: Переключиться в Обзор

source: _Overview
ru: _Обзор

source: Switch to User Backup Sets
ru: Переключить в Пользовательский набор резервирования

source: _Backup Sets
ru: _Наборы для резервирования

source: Switch to One-Time Backup
ru: Переключиться на Разовое резервирование

source: O_ne-Time Backup
ru: _Разовое резервирование

source: Switch to Log Viewer
ru: Переключиться в Просмотр журнала

source: _Log
ru: _Журнал

source: Switch to Restore
ru: Переключиться в Восстановление

source: _Restore
ru: _Восстановить

source: _Help
ru: _Справка

source: Check for _Updates
ru: _Проверить обновления

source: About fwbackups
ru: О fwbackups

source: <span size="large"> A feature-rich user backup program</span>
ru: <span size="large"> Программа резервирования с продвинутыми настройками</span>

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
ru: fwbackup - это свободная программа; вы можете распространять её и/или модифицировать в соответствии с лицензией GNU General Public License, которая опубликована Free Software Foundation; или версией 2 лицензии, или (по вашему желанию) любой поздней версией. fwbackup распространяется в надежде, что она будет полезна, но БЕЗ ЛЮБЫХ ГАРАНТИЙ; даже без подразумеваемой гарантии КОММЕРЧЕСКОЙ ЦЕННОСТИ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНЫХ ЦЕЛЕЙ. Смотрите GNU General Public License для подробностей. Вы должны были получить копию GNU General Public License с программой; если нет, то напишите в Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA

source: License
ru: Лицензия

source: Developers: Stewart Adam < s.adam@diffingo.com > Documenters: Stewart Adam < s.adam@diffingo.com > Translators: N/A Graphic Designers: Stewart Adam < s.adam@diffingo.com > * Based on gnome-icon-theme icons
ru: Разработчики: Stewart Adam < s.adam@diffingo.com > Документация: Stewart Adam < s.adam@diffingo.com > Переводчики: Александр Казанцев <kazancas@gmail.com> Алексей Логинов <loginov.alex.valer@gmail.com> Дизайн: Stewart Adam < s.adam@diffingo.com > * Основан на иконках gnome-icon-theme

source: Credits
ru: Авторы

source: Select a file or folder
ru: Выбор файла или папки

source: <span size="larger" weight="bold">Primary text</span> Secondary text
ru: <span size="larger" weight="bold">Основной текст</span> Дополнительный текст
uk: <span size="larger" weight="bold">Основний текст</span> Додатковий текст

source: Don't show me this message again
ru: Не показывать больше это сообщение
uk: Не показувати більше це повідомлення

source: Save to...
ru: Сохранение в...

source: Status: fwbackups is running
ru: Статус: fwbackups запущен

source: _Show Administrator
ru: _Показать окно управления

source: _Minimize to tray on close
ru: _Минимизировать в сист. лоток при закрытии

source: Display _Notifications
ru: Отображать уведомления

source: Edit preferences
ru: Редактировать параметры

source: _Preferences
ru: _Параметры

source: _Quit
ru: _Выход

source: _Export
ru: _Экспорт
uk: _Експорт

source: Export to:
ru: Экспорт в:

source: <span size="larger" weight="bold">Export Sets</span>
ru: <span weight="bold" size="larger">Экспорт наборов</span>
uk: <span weight="bold" size="larger">Експорт наборів</span>

source: Select the set you would like to export.
ru: Выбор наборов для экспорта.
uk: Вибір наборів для експорту.

source: Restore Files
ru: Восстановление файлов
uk: Відновлення файлів

source: Set backup Local archive Local folder Remote archive (SSH) Remote folder (SSH)
ru: Набор резервирования Локальный архив Локальная папка Удалённый архив (SSH) Удалённая папка (SSH)

source: Set:
ru: Набор:
uk: Набір:

source: Date:
ru: Дата:
uk: Дата:

source: Browse...
ru: Обзор...

source: Archive:
ru: Архив:
uk: Архів:

source: Location:
ru: Расположение:
uk: Розташування:

source: Test Settings
ru: Тест настроек
uk: Тест налаштувань

source: <i>Note: fwbackups will copy the remote backup to the disk first, then unpack it. Please ensure enough disk space is available.</i>
ru: <i>Примечание: fwbackups скопирует сначала удалённую резервную копию на диск, а затем разархивирует её. Убедитесь, что у вас достаточно места.</i>

source: Source type:
ru: Тип источника:
uk: Тип джерела:

source: Restore to:
ru: Восстановить в:
uk: Відновити у:

source: <i>Tip: entering '/' or selecting </i>'File System'<i> will restore files to their original locations.</i>
ru: <i>Совет: ввод '/' или выбор </i>'Файловая система'<i> восстановит файлы в их изначальное расположение.</i>

source: Restore Progress:
ru: Прогресс восстановления:
uk: Поступ відновлення:

source: Start _Restore
ru: Запуск _восстановления

source: Preferences
ru: Параметры
uk: Параметри

source: Minimize to tray on close
ru: Сворачивать в системный лоток при закрытии

source: Show notifications in tray area
ru: Показывать уведомления в системном лотке
